In [68]:
import pandas as pd

data = {
    "NAME": ["ALAN", "MATT", "CHAD", "TYLER", "EMMA"],
    "AGE": [25, None, 30, 40, None],
    "CITY": ["NEW YORK", "LONDON", None, "PARIS", "BERLIN"],
    "SALARY": [50000, 60000, None, 80000, 90000]
}

df = pd.DataFrame(data)
print(df)

    NAME   AGE      CITY   SALARY
0   ALAN  25.0  NEW YORK  50000.0
1   MATT   NaN    LONDON  60000.0
2   CHAD  30.0      None      NaN
3  TYLER  40.0     PARIS  80000.0
4   EMMA   NaN    BERLIN  90000.0

In [69]:
import pandas as pd
#to check the null values through boolean#

data = {
    "NAME": ["ALAN", "MATT", "CHAD", "TYLER", "EMMA"],
    "AGE": [25, None, 30, 40, None],   # fixed NONE â†’ None
    "CITY": ["NEW YORK", "LONDON", None, "PARIS", "BERLIN"],
    "SALARY": [50000, 60000, None, 80000, 90000]
}

df=df.isnull()

print(df)

    NAME    AGE   CITY  SALARY
0  False  False  False   False
1  False   True  False   False
2  False  False   True    True
3  False  False  False   False
4  False   True  False   False



> Add blockquote

In [70]:
import pandas as pd
#TO fill up the null values

data = {
    "NAME": ["ALAN", "MATT", "CHAD", "TYLER", "EMMA"],
    "AGE": [25, None, 30, 40, None],
    "CITY": ["NEW YORK", "LONDON", None, "PARIS", "BERLIN"],
    "SALARY": [50000, 60000, None, 80000, 90000]
}

df = pd.DataFrame(data)

df["AGE"].fillna(df["AGE"].mean(), inplace=True)

df["SALARY"].fillna(df["SALARY"].mean(), inplace=True)

print(df)

    NAME        AGE      CITY   SALARY
0   ALAN  25.000000  NEW YORK  50000.0
1   MATT  31.666667    LONDON  60000.0
2   CHAD  30.000000      None  70000.0
3  TYLER  40.000000     PARIS  80000.0
4   EMMA  31.666667    BERLIN  90000.0

/tmp/ipython-input-3691738726.py:13: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["AGE"].fillna(df["AGE"].mean(), inplace=True)
/tmp/ipython-input-3691738726.py:15: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["SALARY"].fillna(df["SALARY"].mean(), inplace=True)

In [71]:
import pandas as pd
data = {
    "NAME": ["ALAN", "MATT", "CHAD", "TYLER", "EMMA"],
    "AGE": [25, None, 30, 40, None],
    "CITY": ["NEW YORK", "LONDON", None, "PARIS", "BERLIN"],
    "SALARY": [50000, 60000, None, 80000, 90000]
}

df = pd.DataFrame(data)

df = df.dropna(subset=["SALARY"])

print(df)

    NAME   AGE      CITY   SALARY
0   ALAN  25.0  NEW YORK  50000.0
1   MATT   NaN    LONDON  60000.0
3  TYLER  40.0     PARIS  80000.0
4   EMMA   NaN    BERLIN  90000.0

In [72]:
import pandas as pd
data = {
    "NAME": ["ALAN", "MATT", "CHAD", "TYLER", "EMMA"],
    "AGE": [26, 30, 25, 25, 40],
    "CITY": ["NEW YORK", "LONDON", None, "PARIS", "BERLIN"],
    "SALARY": [50000, 60000, None, 80000, 90000]
}

df = pd.DataFrame(data)
df=df.drop_duplicates("AGE")
print(df)

   NAME  AGE      CITY   SALARY
0  ALAN   26  NEW YORK  50000.0
1  MATT   30    LONDON  60000.0
2  CHAD   25      None      NaN
4  EMMA   40    BERLIN  90000.0

In [73]:
import pandas as pd
data = {
    "NAME": ["ALAN", "MATT", "CHAD", "TYLER", "EMMA"],
    "AGE": [26, 30, 25, 25, 40],
    "CITY": ["NEW YORK", "LONDON", None, "PARIS", "BERLIN"],
    "SALARY": [50000, 60000, None, 80000, 90000]
}

df = pd.DataFrame(data)

print(df.duplicated(subset=["AGE"]))

0    False
1    False
2    False
3     True
4    False
dtype: bool

In [74]:
import pandas as pd
data = {
    "NAME": ["ALAN", "MATT", "CHAD", "TYLER", "EMMA"],
    "AGE": [26, 30, 25, 25, 40],
    "CITY": ["NEW YORK", "LONDON", None, "PARIS", "BERLIN"],
    "SALARY": [50000, 60000, None, 80000, 90000]
}
df = pd.DataFrame(data)

df = df.rename(columns={"NAME":  "Employee_Name", "AGE":  "Employee_Age"})

print(df)

  Employee_Name  Employee_Age      CITY   SALARY
0          ALAN            26  NEW YORK  50000.0
1          MATT            30    LONDON  60000.0
2          CHAD            25      None      NaN
3         TYLER            25     PARIS  80000.0
4          EMMA            40    BERLIN  90000.0

In [75]:
import pandas as pd
data = {
    "NAME": ["ALAN", "MATT", "CHAD", "TYLER", "EMMA"],
    "AGE": [26, 30, 25, 25, 40],
    "CITY": ["NEW YORK", "LONDON", None, "PARIS", "BERLIN"],
    "SALARY": [50000, 60000, None, 80000, 90000]
}

df = pd.DataFrame(data)
df["AGE"] = df["AGE"].astype(float)

print(df)

    NAME   AGE      CITY   SALARY
0   ALAN  26.0  NEW YORK  50000.0
1   MATT  30.0    LONDON  60000.0
2   CHAD  25.0      None      NaN
3  TYLER  25.0     PARIS  80000.0
4   EMMA  40.0    BERLIN  90000.0

In [76]:
import pandas as pd
data = {
    "NAME": ["ALAN", "MATT", "CHAD", "TYLER", "EMMA"],
    "AGE": [26, 30, 25, 25, 40],
    "CITY": ["NEW YORK", "LONDON", None, "PARIS", "BERLIN"],
    "SALARY": [110000, 40000, None, 80000, 90000]
}

df = pd.DataFrame(data)
df_filtered = df[df["SALARY"] > 60000]
print(df_filtered)

    NAME  AGE      CITY    SALARY
0   ALAN   26  NEW YORK  110000.0
3  TYLER   25     PARIS   80000.0
4   EMMA   40    BERLIN   90000.0

In [77]:
import pandas as pd
data = {
    "NAME": ["ALAN", "MATT", "CHAD", "TYLER", "EMMA"],
    "AGE": [26, 30, 25, 25, 40],
    "CITY": ["NEW YORK", "LONDON", None, "PARIS", "BERLIN"],
    "SALARY": [110000, 40000, None, 80000, 90000]
}

df = pd.DataFrame(data)
df['Bonus'] = df['SALARY'] * 0.10
print(df)

    NAME  AGE      CITY    SALARY    Bonus
0   ALAN   26  NEW YORK  110000.0  11000.0
1   MATT   30    LONDON   40000.0   4000.0
2   CHAD   25      None       NaN      NaN
3  TYLER   25     PARIS   80000.0   8000.0
4   EMMA   40    BERLIN   90000.0   9000.0

In [78]:
import pandas as pd
data = {
    "NAME": ["ALAN", "MATT", "CHAD", "TYLER", "EMMA"],
    "AGE": [26, 30, 25, 25, 40],
    "CITY": ["NEW YORK", "LONDON", None, "PARIS", "BERLIN"],
    "SALARY": [110000, 40000, None, 80000, 90000]
}

df = pd.DataFrame(data)
import pandas as pd
data = {
    "NAME": ["ALICE", "BOB", "CHARLIE", "DAVID", "EVE"],
    "AGE": [26, 30, 25, 25, 40],
    "CITY": ["NEW YORK", "LONDON", None, "PARIS", "BERLIN"],
    "SALARY": [110000, 40000, None, 80000, 90000]
}

df = pd.DataFrame(data)
df = df.sort_values(by='SALARY', ascending=False)
print(df)

      NAME  AGE      CITY    SALARY
0    ALICE   26  NEW YORK  110000.0
4      EVE   40    BERLIN   90000.0
3    DAVID   25     PARIS   80000.0
1      BOB   30    LONDON   40000.0
2  CHARLIE   25      None       NaN

In [80]:
import pandas as pd
data = {
    "NAME": ["ALAN", "MATT", "CHAD", "TYLER", "EMMA"],
    "AGE": [26, 30, 25, 25, 40],
    "CITY": ["NEW YORK", "LONDON", None, "PARIS", "BERLIN"],
    "SALARY": [110000, 40000, None, 80000, 90000]
}



df = pd.DataFrame(data)
df_group = df.groupby('CITY')['SALARY'].mean()
print(df_group)

CITY
BERLIN       90000.0
LONDON       40000.0
NEW YORK    110000.0
PARIS        80000.0
Name: SALARY, dtype: float64